while True:
    a=int(input('是否是夏季  是輸入1  不是書入0  (輸入3結束程式) \n'))
    

    if a==1:
        b=float(input("輸入用電度:"))
        p1=1.63
        p2=2.45
        p3=3.70
        p4=5.04
        p5=6.34
        p6=8.46
        if b<=120:
            asn=b*p1
        elif b<=330:
            asn=(b-120)*p2+120*p1
        elif b <= 500:
            asn=(b-331)*p3+(330-120)*p2+120*p1
        elif b <= 700:
            asn=(b-501)*p4+(500-330)*p3+(330-120)*p2+120*p1
        elif b <=100:
            asn=(b-701)*p5+(700-500)*p4+(500-330)*p3+(330-120)*p2+120*p1
        else:
            asn=(b-1001)*p6+(1000-700)*p5+(700-500)*p4+(500-330)*p3+(330-120)*p2+120*p1
        
        print("用電",b,"度 共",asn,"元")

    elif a==0:
        b=float(input("輸入用電度:"))
        p1=1.68
        p2=2.16
        p3=3.03
        p4=4.14
        p5=5.07
        p6=6.63
        if b<=120:
            asn=b*p1
        elif b<=330:
            asn=(b-120)*p2+120*p1
        elif b <= 500:
            asn=(b-331)*p3+(330-120)*p2+120*p1
        elif b <= 700:
            asn=(b-501)*p4+(500-330)*p3+(330-120)*p2+120*p1
        elif b <=100:
            asn=(b-701)*p5+(700-500)*p4+(500-330)*p3+(330-120)*p2+120*p1
        else:
            asn=(b-1001)*p6+(1000-700)*p5+(700-500)*p4+(500-330)*p3+(330-120)*p2+120*p1
        
        print("用電",b,"度 共",asn,"元")
    
    elif a==3:
        print("程式結束")
        break
   
    
    else:
        print("你有病")    




            
